#ifndef __PCF8591_H__
#define __PCF8591_H__

/*------------------------------------------------
                   AD处理函数
------------------------------------------------*/
unsigned char  ADCheck(void);
/*------------------------------------------------
             读AD转值程序
输入参数 Chl 表示需要转换的通道，范围从0-3
返回值范围0-255
------------------------------------------------*/
unsigned char ReadADC(unsigned char Chl);
/*------------------------------------------------
               写入DA转换数值
输入参数：dat 表示需要转换的DA数值，范围是0-255
------------------------------------------------*/
bit WriteDAC(unsigned char dat);

#endif
