#ifndef __UART_H__
#define __UART_H__

#include<reg52.h> //包含头文件，一般情况不需要改动，头文件包含特殊功能寄存器的定义                        


/*------------------------------------------------
                    串口初始化
------------------------------------------------*/
void InitUART  (void);

/*------------------------------------------------
                    发送一个字节
------------------------------------------------*/
void UartSendByte(unsigned char dat);
/*------------------------------------------------
                    发送一个字符串
------------------------------------------------*/
void UartSendStr(unsigned char *s);

#endif